Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/context_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: context title: Context permalink: docs/context.html ---
ja: --- id: context title: コンテクスト permalink: docs/context.html ---

source: Context provides a way to pass data through the component tree without having to pass props down manually at every level.
ja: コンテクストは各階層で手動でプロパティを下に渡すことなく、コンポーネントツリー内でデータを渡す方法を提供します。

source: In a typical React application, data is passed top-down (parent to child) via props, but such usage can be cumbersome for certain types of props (e.g. locale preference, UI theme) that are required by many components within an application.
ja: 典型的な React アプリケーションでは、データは props を通してトップダウン（親から子）で渡されますが、このようなやり方は、アプリケーション内の多くのコンポーネントから必要とされる特定のタイプのプロパティ（例： ロケール設定、UI テーマ）にとっては面倒です。

source: Context provides a way to share values like these between components without having to explicitly pass a prop through every level of the tree.
ja: コンテクストはツリーの各階層で明示的にプロパティを渡すことなく、コンポーネント間でこれらの様な値を共有する方法を提供します。

source: - [When to Use Context](#when-to-use-context) - [Before You Use Context](#before-you-use-context) - [API](#api)
ja: - [コンテクストをいつ使用すべきか](#when-to-use-context) - [コンテクストを使用する前に](#before-you-use-context) - [API](#api)

source: - [Context.displayName](#contextdisplayname) - [Examples](#examples)
ja: - [Context.displayName](#contextdisplayname) - [例](#例)

source: - [Dynamic Context](#dynamic-context)
ja: - [動的なコンテクスト](#dynamic-context)

source: - [Updating Context from a Nested Component](#updating-context-from-a-nested-component)
ja: - [ネストしたコンポーネントからコンテクストを更新する](#updating-context-from-a-nested-component)

source: - [Consuming Multiple Contexts](#consuming-multiple-contexts) - [Caveats](#caveats) - [Legacy API](#legacy-api)
ja: - [複数のコンテクストを使用する](#consuming-multiple-contexts) - [注意事項](#caveats) - [レガシーな API](#legacy-api)

source: ## When to Use Context {#when-to-use-context}
ja: ## コンテクストをいつ使用すべきか {#when-to-use-context}

source: Context is designed to share data that can be considered "global" for a tree of React components, such as the current authenticated user, theme, or preferred language.
ja: コンテクストは、ある React コンポーネントのツリーに対して「グローバル」とみなすことができる、現在の認証済みユーザ・テーマ・優先言語といったデータを共有するために設計されています。

source: For example, in the code below we manually thread through a "theme" prop in order to style the Button component:
ja: 例えば、以下のコードでは Button コンポーネントをスタイルする為に、手動で "theme" プロパティを通しています。

source: Using context, we can avoid passing props through intermediate elements:
ja: コンテクストを使用することで、中間の要素群を経由してプロパティを渡すことを避けることができます。

source: ## Before You Use Context {#before-you-use-context}
ja: ## コンテクストを使用する前に {#before-you-use-context}

source: Context is primarily used when some data needs to be accessible by *many* components at different nesting levels.
ja: コンテクストは主に、何らかのデータが、ネストレベルの異なる*多く*のコンポーネントからアクセスできる必要がある時に使用されます。

source: Apply it sparingly because it makes component reuse more difficult.
ja: コンテクストはコンポーネントの再利用をより難しくする為、慎重に利用してください。

source: **If you only want to avoid passing some props through many levels, [component composition](/docs/composition-vs-inheritance.html) is often a simpler solution than context.**
ja: **もし多くの階層を経由していくつかの props を渡すことを避けたいだけであれば、[コンポーネントコンポジション](/docs/composition-vs-inheritance.html)は多くの場合、コンテクストよりシンプルな解決策です。**

source: For example, consider a `Page` component that passes a `user` and `avatarSize` prop several levels down so that deeply nested `Link` and `Avatar` components can read it:
ja: 例えば、深くネストされた `Link` と `Avatar` コンポーネントがプロパティを読み取ることが出来るように、`user` と `avatarSize` プロパティをいくつかの階層下へ渡す `Page` コンポーネントを考えてみましょう。

source: ```js <Page user={user} avatarSize={avatarSize} /> // ... which renders ... <PageLayout user={user} avatarSize={avatarSize} /> // ... which renders ... <NavigationBar user={user} avatarSize={avatarSize} /> // ... which renders ... <Link href={user.permalink}>
ja: ```js <Page user={user} avatarSize={avatarSize} /> // ...Page コンポーネントは以下をレンダー ... <PageLayout user={user} avatarSize={avatarSize} /> // ...PageLayout コンポーネントは以下をレンダー ... <NavigationBar user={user} avatarSize={avatarSize} /> // ...NavigationBar コンポーネントは以下をレンダー ... <Link href={user.permalink}>

source: It might feel redundant to pass down the `user` and `avatarSize` props through many levels if in the end only the `Avatar` component really needs it.
ja: 最終的に `Avatar` コンポーネントだけがプロパティを必要としているのであれば、多くの階層を通して `user` と `avatarSize` プロパティを下に渡すことは冗長に感じるかもしれません。

source: It's also annoying that whenever the `Avatar` component needs more props from the top, you have to add them at all the intermediate levels too.
ja: また、`Avatar` コンポーネントが上のコンポーネントから追加のプロパティを必要とする時はいつでも、全ての間の階層にも追加しないといけないことも厄介です。

source: One way to solve this issue **without context** is to [pass down the `Avatar` component itself](/docs/composition-vs-inheritance.html#containment) so that the intermediate components don't need to know about the `user` or `avatarSize` props:
ja: **コンテクストを使用せずに**この問題を解決する 1 つの手法は、[`Avatar` コンポーネント自身を渡す](/docs/composition-vs-inheritance.html#containment)ようにするというもので、そうすれば間のコンポーネントは `user` や `avatarSize` プロパティを知る必要はありません。

source: return <PageLayout userLink={userLink} />; }
ja: return <PageLayout userLink={userLink} />; }// これで以下のようになります。

source: // Now, we have: <Page user={user} avatarSize={avatarSize} /> // ... which renders ... <PageLayout userLink={...} /> // ... which renders ... <NavigationBar userLink={...} /> // ... which renders ... {props.userLink} ```
ja: <Page user={user} avatarSize={avatarSize} /> // ...Page コンポーネントは以下をレンダー ... <PageLayout userLink={...} /> // ...PageLayout コンポーネントは以下をレンダー ... <NavigationBar userLink={...} /> // ...NavigationBar コンポーネントは以下をレンダー ... {props.userLink} ```

source: With this change, only the top-most Page component needs to know about the `Link` and `Avatar` components' use of `user` and `avatarSize`.
ja: この変更により、一番上の Page コンポーネントだけが、`Link` と `Avatar` コンポーネントの `user` と `avatarSize` の使い道について知る必要があります。

source: This *inversion of control* can make your code cleaner in many cases by reducing the amount of props you need to pass through your application and giving more control to the root components.
ja: この*制御の反転*はアプリケーション内で取り回す必要のあるプロパティの量を減らし、ルートコンポーネントにより多くの制御を与えることにより、多くのケースでコードを綺麗にすることができます。

source: Such inversion, however, isn't the right choice in every case; moving more complexity higher in the tree makes those higher-level components more complicated and forces the lower-level components to be more flexible than you may want.
ja: しかし、このような制御の反転がすべてのケースで正しい選択となるわけではありません。ツリー内の上層に複雑性が移ることは、それら高い階層のコンポーネントをより複雑にして、低い階層のコンポーネントに必要以上の柔軟性を強制します。

source: You're not limited to a single child for a component.
ja: コンポーネントに対して 1 つの子までという制限はありません。

source: You may pass multiple children, or even have multiple separate "slots" for children, [as documented here](/docs/composition-vs-inheritance.html#containment):
ja: 複数の子を渡したり、子のために複数の別々の「スロット」を持つことさえできます。[ドキュメントはここにあります。](/docs/composition-vs-inheritance.html#containment)

source: This pattern is sufficient for many cases when you need to decouple a child from its immediate parents.
ja: このパターンは、そのすぐ上の親から子を切り離す必要がある多くのケースにとって十分です。

source: You can take it even further with [render props](/docs/render-props.html) if the child needs to communicate with the parent before rendering.
ja: レンダーの前に子が親とやり取りする必要がある場合、さらに[レンダープロップ](/docs/render-props.html)と合わせて使うことができます。

source: However, sometimes the same data needs to be accessible by many components in the tree, and at different nesting levels.
ja: しかし、たまに同じデータがツリー内の異なるネスト階層にある多くのコンポーネントからアクセス可能であることが必要となります。

source: Context lets you "broadcast" such data, and changes to it, to all components below.
ja: コンテクストはそのようなデータとその変更を以下の全てのコンポーネントへ「ブロードキャスト」できます。

source: Common examples where using context might be simpler than the alternatives include managing the current locale, theme, or a data cache.
ja: コンテクストを使うことが他の手法よりシンプルである一般的な例としては、現在のロケール、テーマ、またはデータキャッシュの管理が挙げられます。

source: Creates a Context object.
ja: コンテクストオブジェクトを作成します。

source: When React renders a component that subscribes to this Context object it will read the current context value from the closest matching `Provider` above it in the tree.
ja: React がこのコンテクストオブジェクトが登録されているコンポーネントをレンダーする場合、ツリー内の最も近い上位の一致する `Provider` から現在のコンテクストの値を読み取ります。

source: The `defaultValue` argument is **only** used when a component does not have a matching Provider above it in the tree.
ja: `defaultValue` 引数は、コンポーネントがツリー内の上位に対応するプロバイダを持っていない場合のみ使用されます。

source: This default value can be helpful for testing components in isolation without wrapping them.
ja: このようなデフォルト値は、ラップしない単独でのコンポーネントのテストにて役に立ちます。

source: Note: passing `undefined` as a Provider value does not cause consuming components to use `defaultValue`.
ja: 補足： `undefined` をプロバイダの値として渡しても、コンシューマコンポーネントが `defaultValue` を使用することはありません。

source: ```js <MyContext.Provider value={/* some value */}> ```
ja: ```js <MyContext.Provider value={/* 何らかの値 */}> ```

source: Every Context object comes with a Provider React component that allows consuming components to subscribe to context changes.
ja: 全てのコンテクストオブジェクトにはプロバイダ (Provider) コンポーネントが付属しており、これによりコンシューマコンポーネントはコンテクストの変更を購読できます。

source: The Provider component accepts a `value` prop to be passed to consuming components that are descendants of this Provider.
ja: プロバイダコンポーネントは `value` プロパティを受け取り、これが子孫であるコンシューマコンポーネントに渡されます。

source: One Provider can be connected to many consumers.
ja: 1 つのプロバイダは多くのコンシューマと接続することができます。

source: Providers can be nested to override values deeper within the tree.
ja: プロバイダはネストしてツリー内のより深い位置で値を上書きすることができます。

source: All consumers that are descendants of a Provider will re-render whenever the Provider's `value` prop changes.
ja: プロバイダの子孫の全てのコンシューマは、プロバイダの `value` プロパティが変更されるたびに再レンダーされます。

source: The propagation from Provider to its descendant consumers (including [`.contextType`](#classcontexttype) and [`useContext`](/docs/hooks-reference.html#usecontext)) is not subject to the `shouldComponentUpdate` method, so the consumer is updated even when an ancestor component skips an update.
ja: プロバイダからその子孫コンシューマ（[`.contextType`](#classcontexttype) や [`useContext`](/docs/hooks-reference.html#usecontext) を含む）への伝播は `shouldComponentUpdate` メソッドの影響を受けないため、コンシューマは祖先のコンポーネントが更新をスキップしている場合でも更新されます。

source: Changes are determined by comparing the new and old values using the same algorithm as [`Object.is`](//developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/is#Description).
ja: 変更は、[`Object.is`](//developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/is#Description) と同じアルゴリズムを使用し、新しい値と古い値の比較によって判断されます。

source: > Note > > The way changes are determined can cause some issues when passing objects as `value`: see [Caveats](#caveats).
ja: > 補足 > > この方法で変更の有無を判断するため、オブジェクトを `value` として渡した場合にいくつかの問題が発生する可能性があります。詳細は[注意事項](#caveats)を参照してください。

source: /* perform a side-effect at mount using the value of MyContext */
ja: /* MyContextの値を使用し、マウント時に副作用を実行します */

source: /* render something based on the value of MyContext */
ja: /* MyContextの値に基づいて何かをレンダーします */

source: The `contextType` property on a class can be assigned a Context object created by [`React.createContext()`](#reactcreatecontext).
ja: クラスの `contextType` プロパティには [`React.createContext()`](#reactcreatecontext) により作成されたコンテクストオブジェクトを指定することができます。

source: Using this property lets you consume the nearest current value of that Context type using `this.context`.
ja: これにより、`this.context` を使って、そのコンテクストタイプの最も近い現在値を利用できます。

source: You can reference this in any of the lifecycle methods including the render function.
ja: レンダー関数を含むあらゆるライフサイクルメソッドで参照できます。

source: > Note: > > You can only subscribe to a single context using this API.
ja: > 補足: > > この API では、1 つのコンテクストだけ登録することができます。

source: If you need to read more than one see [Consuming Multiple Contexts](#consuming-multiple-contexts).
ja: もし 2 つ以上を読み取る必要がある場合、[複数のコンテクストを使用する](#consuming-multiple-contexts)を参照してください。

source: > > If you are using the experimental [public class fields syntax](https://babeljs.io/docs/plugins/transform-class-properties/), you can use a **static** class field to initialize your `contextType`.
ja: > > 実験的な [public class fields syntax](https://babeljs.io/docs/plugins/transform-class-properties/) を使用している場合、**static** クラスフィールドを使用することで `contextType` を初期化することができます。

source: /* render something based on the value */
ja: /* 値に基づいて何かをレンダーします */

source: {value => /* render something based on the context value */} </MyContext.Consumer> ```
ja: {value => /* コンテクストの値に基づいて何かをレンダーします */} </MyContext.Consumer> ```

source: A React component that subscribes to context changes.
ja: コンテクストの変更を購読する React コンポーネントです。

source: Using this component lets you subscribe to a context within a [function component](/docs/components-and-props.html#function-and-class-components).
ja: このコンポーネントを使うことで、[関数コンポーネント](/docs/components-and-props.html#function-and-class-components)内でコンテクストを購読することができます。

source: Requires a [function as a child](/docs/render-props.html#using-props-other-than-render).
ja: [function as a child](/docs/render-props.html#using-props-other-than-render) が必要です。

source: The function receives the current context value and returns a React node.
ja: この関数は現在のコンテクストの値を受け取り、React ノードを返します。

source: The `value` argument passed to the function will be equal to the `value` prop of the closest Provider for this context above in the tree.
ja: この関数に渡される引数 `value` は、ツリー内の上位で一番近いこのコンテクスト用のプロバイダの `value` プロパティと等しくなります。

source: If there is no Provider for this context above, the `value` argument will be equal to the `defaultValue` that was passed to `createContext()`.
ja: このコンテクスト用のプロバイダが上位に存在しない場合、引数の `value` は `createContext()` から渡された `defaultValue` と等しくなります。

source: > Note > > For more information about the 'function as a child' pattern, see [render props](/docs/render-props.html).
ja: > 補足 > > "function as a child" パターンについてさらに情報が必要な場合は[レンダープロップ](/docs/render-props.html)を参照してください。

source: Context object accepts a `displayName` string property.
ja: コンテクストオブジェクトは `displayName` という文字列型のプロパティを有しています。

source: React DevTools uses this string to determine what to display for the context.
ja: React DevTools はこの文字列を利用してコンテクストの表示のしかたを決定します。

source: For example, the following component will appear as MyDisplayName in the DevTools:
ja: 例えば以下のコンポーネントは DevTools で MyDisplayName と表示されます。

source: ## Examples {#examples}
ja: ## 例 {#examples}

source: ### Dynamic Context {#dynamic-context}
ja: ### 動的なコンテクスト {#dynamic-context}

source: A more complex example with dynamic values for the theme:
ja: テーマに動的な値を使用したより複雑な例：

source: ### Updating Context from a Nested Component {#updating-context-from-a-nested-component}
ja: ### ネストしたコンポーネントからコンテクストを更新する {#updating-context-from-a-nested-component}

source: It is often necessary to update the context from a component that is nested somewhere deeply in the component tree.
ja: コンポーネントツリーのどこか深くネストされたコンポーネントからコンテクストを更新することはよく必要になります。

source: In this case you can pass a function down through the context to allow consumers to update the context:
ja: このケースでは、コンテクストを通して下に関数を渡すことで、コンシューマがコンテクストを更新可能にすることができます。

source: ### Consuming Multiple Contexts {#consuming-multiple-contexts}
ja: ### 複数のコンテクストを使用する {#consuming-multiple-contexts}

source: To keep context re-rendering fast, React needs to make each context consumer a separate node in the tree.
ja: コンテクストの再レンダーを高速に保つために、React は各コンテクストのコンシューマをツリー内の別々のノードにする必要があります。

source: If two or more context values are often used together, you might want to consider creating your own render prop component that provides both.
ja: 2 つ以上のコンテクストの値が一緒に使用されることが多い場合、両方を提供する独自のレンダープロップコンポーネントの作成を検討した方が良いかもしれません。

source: ## Caveats {#caveats}
ja: ## 注意事項 {#caveats}

source: Because context uses reference identity to determine when to re-render, there are some gotchas that could trigger unintentional renders in consumers when a provider's parent re-renders.
ja: コンテクストは参照の同一性を使用していつ再レンダーするかを決定するため、プロバイダの親が再レンダーするときにコンシューマで意図しないレンダーを引き起こす可能性があるいくつかの問題があります。

source: For example, the code below will re-render all consumers every time the Provider re-renders because a new object is always created for `value`:
ja: 例えば以下のコードでは、新しいオブジェクトが `value` に対して常に作成されるため、プロバイダが再レンダーするたびにすべてのコンシューマを再レンダーしてしまいます。

source: To get around this, lift the value into the parent's state:
ja: この問題を回避するためには、親の state に値をリフトアップします。

source: ## Legacy API {#legacy-api}
ja: ## レガシーな API {#legacy-api}

source: > Note > > React previously shipped with an experimental context API.
ja: > 補足 > > React は以前に実験的なコンテクスト API を公開していました。

source: The old API will be supported in all 16.x releases, but applications using it should migrate to the new version.
ja: その古い API は全ての 16.x 系のリリースでサポートされる予定ですが、アプリケーションで使用しているのであれば、新しいバージョンにマイグレーションすべきです。

source: The legacy API will be removed in a future major React version.
ja: レガシーな API は将来の React メジャーバージョンで削除されます。

source: Read the [legacy context docs here](/docs/legacy-context.html).
ja: [レガシーなコンテクストのドキュメントはここにあります。](/docs/legacy-context.html)
